Tekla Open API Reference for Tekla Structures 2025
MeshSelectionForm Constructor
Overload List
Name | Description
MeshSelectionForm(List<MeshItem>)
 Creates a new instance of the MeshSelectionForm.
MeshSelectionForm(List<MeshItem>, String, String)
 Creates a new instance of the MeshSelectionForm and will select in the tree the mesh that contains the given parameters (if possible).
Top
See Also
Reference
MeshSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace